load-test/results/2026-08-16-baseline/probe-s1-AFTER.txt
  █ TOTAL RESULTS 

    checks_total.......: 179358  596.076446/s
    checks_succeeded...: 100.00% 179358 out of 179358
    checks_failed......: 0.00%   0 out of 179358

    ✓ 커뮤니티 지도 목록: 200
    ✓ 커뮤니티 지도 목록: 응답에 데이터 있음
    ✓ 공식 지도 목록: 200
    ✓ 공식 지도 목록: 응답에 데이터 있음
    ✓ 추천 지도: 200
    ✓ 추천 지도: 응답에 데이터 있음

    HTTP
    http_req_duration.............................: avg=21.81ms min=294µs  med=7.01ms  max=1.61s p(90)=19.61ms p(95)=37.38ms
      { expected_response:true }..................: avg=21.81ms min=294µs  med=7.01ms  max=1.61s p(90)=19.61ms p(95)=37.38ms
      { name:GET /maps?sort=POPULAR (deep) }......: avg=19.44ms min=4.95ms med=7.03ms  max=1.42s p(90)=12.46ms p(95)=31.83ms
      { name:GET /maps?sort=POPULAR (shallow) }...: avg=19.09ms min=4.62ms med=6.06ms  max=1.33s p(90)=11.2ms  p(95)=30.59ms
      { name:GET /maps/official }.................: avg=16.72ms min=2.94ms med=4.35ms  max=1.46s p(90)=8.58ms  p(95)=27.03ms
      { name:GET /maps/recommendations }..........: avg=29.45ms min=294µs  med=16.33ms max=1.61s p(90)=25.98ms p(95)=47.24ms
    http_req_failed...............................: 0.00%  0 out of 89679
    http_reqs.....................................: 89679  298.038223/s

    EXECUTION
    dropped_iterations............................: 256    0.850788/s
    iteration_duration............................: avg=1.03s   min=1.01s  med=1.01s   max=2.61s p(90)=1.02s   p(95)=1.05s  
    iterations....................................: 29893  99.346074/s
    vus...........................................: 4      min=1          max=284
    vus_max.......................................: 305    min=50         max=305

    NETWORK
    data_received.................................: 365 MB 1.2 MB/s
    data_sent.....................................: 28 MB  92 kB/s



s1_home ✓ [ 100% ] 000/305 VUs  5m0s  200.00 iters/s
time="2026-08-16T16:01:16+09:00" level=error msg="thresholds on metrics 'dropped_iterations' have been crossed"