load-test/results/2026-08-16-baseline/smoke-s2-map-detail.txt
  █ TOTAL RESULTS 

    checks_total.......: 336     5.587582/s
    checks_succeeded...: 100.00% 336 out of 336
    checks_failed......: 0.00%   0 out of 336

    ✓ 지도 상세: 200
    ✓ 지도 상세: 응답에 데이터 있음
    ✓ 장소 목록: 200
    ✓ 장소 목록: 응답에 데이터 있음
    ✓ 멤버 목록: 200
    ✓ 멤버 목록: 응답에 데이터 있음

    HTTP
    http_req_duration........................: avg=35.61ms min=10.46ms med=35.97ms max=72.61ms p(90)=50.58ms p(95)=54.74ms
      { expected_response:true }.............: avg=35.61ms min=10.46ms med=35.97ms max=72.61ms p(90)=50.58ms p(95)=54.74ms
      { name:GET /maps/:id }.................: avg=27.38ms min=10.46ms med=27.98ms max=51.16ms p(90)=35.74ms p(95)=37.17ms
      { name:GET /maps/:id/members }.........: avg=35.25ms min=13.58ms med=37.69ms max=53.32ms p(90)=46ms    p(95)=47.92ms
      { name:GET /places?mapId (deep) }......: avg=48.17ms min=22.81ms med=49.97ms max=61.04ms p(90)=58.45ms p(95)=60.4ms 
      { name:GET /places?mapId (shallow) }...: avg=41.61ms min=18.39ms med=42.87ms max=72.61ms p(90)=53.5ms  p(95)=57.97ms
    http_req_failed..........................: 0.00%  0 out of 168
    http_reqs................................: 168    2.793791/s

    EXECUTION
    dropped_iterations.......................: 0      0/s
    iteration_duration.......................: avg=1.07s   min=1.03s   med=1.07s   max=1.1s    p(90)=1.09s   p(95)=1.09s  
    iterations...............................: 56     0.931264/s
    vus......................................: 1      min=1        max=1
    vus_max..................................: 1      min=1        max=1

    NETWORK
    data_received............................: 931 kB 16 kB/s
    data_sent................................: 50 kB  836 B/s



s2_map_detail ✓ [ 100% ] 1 VUs  1m0s